test_cases/2d/aero_3h_2d/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.0186812;
boundaryField
{
    inlet     { type fixedValue; value uniform 0.0186812; }
    outlet    { type inletOutlet; inletValue uniform 0.0186812; value uniform 0.0186812; }
    ground    { type kqRWallFunction; value uniform 0.0186812; }
    buildings { type kqRWallFunction; value uniform 0.0186812; }
    top       { type slip; }
    sides     { type symmetry; }
}

// ************************************************************************* //
