test_cases/2d/aero_3h_2d/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    buildingCells; type cellSet; action new;
        source  boxToCell; box (10.2321 2.9093 0)(10.881 3.2166 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.4871 4.2257 0)(13.1624 4.6117 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.7711 5.394 0)(7.4323 5.8873 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6753 8.4555 0)(9.1712 8.8731 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.5433 3.1608 0)(15.3117 3.4737 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.3555 1.2612 0)(15.6569 1.8029 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.6834 3.2563 0)(11.382 3.6365 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.241 5.1891 0)(12.9848 5.5815 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.823 8.6991 0)(5.1897 9.2517 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5648 1.6751 0)(7.906 2.03 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3582 6.8673 0)(6.0405 7.2354 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.2013 5.3382 0)(10.9408 5.7872 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.7883 3.7138 0)(7.4172 4.2405 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.8799 5.9666 0)(16.2557 6.514 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8591 4.3011 0)(14.4924 4.8678 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.4376 5.6031 0)(8.0613 5.9074 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.2756 7.1953 0)(7.6337 7.7005 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.4293 3.2761 0)(4.0951 3.7665 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.4021 1.338 0)(7.1499 1.9375 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8464 6.2941 0)(14.5877 6.7136 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.6283 3.5838 0)(12.2735 3.8981 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.3667 8.6237 0)(10.7986 8.9417 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.8556 2.3503 0)(6.1821 2.9132 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.8909 8.7808 0)(7.2206 9.1771 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.9406 6.1475 0)(6.3197 6.5007 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6907 6.7934 0)(9.0904 7.2944 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.4638 4.1403 0)(3.9827 4.4722 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.0863 1.1367 0)(16.6593 1.6051 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.4723 2.0284 0)(11.0586 2.5605 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.7239 7.584 0)(6.2677 8.0364 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.672 5.2564 0)(12.1156 5.7085 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.092 2.1636 0)(16.4258 2.7593 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.0428 7.7146 0)(4.3508 8.2117 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.5906 3.8869 0)(12.9071 4.2033 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.6932 4.8639 0)(6.1601 5.2779 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.3597 1.3413 0)(9.9348 1.7632 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.4951 2.1391 0)(8.8822 2.6155 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.7255 2.1638 0)(7.197 2.52 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.8878 8.3283 0)(6.5706 8.8772 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.8457 2.3584 0)(12.352 2.9543 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.2507 5.8486 0)(14.7951 6.2213 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.5218 1.3729 0)(6.1541 1.8682 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.0317 4.4548 0)(7.6977 4.9395 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.6706 1.6227 0)(14.4368 2.1258 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.7548 6.8737 0)(5.2838 7.4281 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.2813 1.9403 0)(9.651 2.4786 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.9357 2.3183 0)(17.5478 2.6937 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.4241 3.2562 0)(17.0569 3.7988 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.3148 7.8915 0)(12.0438 8.3928 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.12 2.6394 0)(14.5833 3.0307 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.0834 5.8172 0)(10.8074 6.2627 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.0269 8.8622 0)(16.537 9.3447 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.9518 7.8951 0)(10.3489 8.4277 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.5112 6.0209 0)(17.1502 6.3554 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0581 8.4709 0)(12.5638 8.7793 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.4957 2.7413 0)(13.8844 3.0805 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.5314 4.8225 0)(17.988 5.1323 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.9555 8.2777 0)(16.2988 8.8225 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.237 7.8695 0)(12.7242 8.3214 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.0118 1.4613 0)(10.3465 2.0609 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.9356 8.2044 0)(17.7184 8.6571 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.8786 4.997 0)(5.3041 5.5572 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.4545 2.1456 0)(4.9035 2.5591 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.0797 3.3667 0)(13.5372 3.8257 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5267 4.9423 0)(8.2384 5.268 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.9354 5.4637 0)(4.3509 5.9609 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.5502 4.254 0)(8.9778 4.7659 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.444 5.6322 0)(5.0077 6.0943 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.8706 5.5134 0)(17.1927 6.0065 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.8428 1.5837 0)(5.1912 2.1316 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.7707 6.561 0)(11.3819 7.1127 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.9602 6.3722 0)(18.2777 6.6917 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.7023 6.6868 0)(4.1785 7.1332 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.4474 7.8795 0)(5.0408 8.1973 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.2262 8.5787 0)(14.9724 8.8877 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.0919 4.2154 0)(17.4636 4.7774 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.4748 3.225 0)(9.1102 3.545 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.8652 2.6336 0)(15.3427 2.9747 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.0748 1.7839 0)(13.6595 2.2564 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1419 5.8656 0)(15.5669 6.2048 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3701 8.9733 0)(5.8318 9.2901 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.0188 6.062 0)(9.6583 6.6364 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.0224 3.5503 0)(5.4404 3.9773 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.3197 4.3081 0)(10.7766 4.8366 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.9117 4.3941 0)(11.4049 4.7258 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.678 6.4982 0)(8.3849 7.0093 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.3159 6.6547 0)(15.7062 7.0182 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.3426 8.8113 0)(12.1418 9.2179 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.2008 7.4349 0)(5.7042 8.0056 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.1081 5.29 0)(11.5829 5.7142 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.066 5.4943 0)(13.4623 6.0593 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.7149 3.3596 0)(6.3706 3.71 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.2811 4.3034 0)(4.6996 4.7252 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8833 7.8225 0)(14.3106 8.2333 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.5479 9.0932 0)(6.8593 9.4706 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.503 4.4543 0)(6.905 5.028 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.5796 7.1439 0)(14.0246 7.739 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.2889 2.2613 0)(3.803 2.8087 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.2911 2.6442 0)(5.0156 3.1828 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.2008 8.2972 0)(4.6467 8.8861 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.4039 7.5326 0)(15.7957 8.0847 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.0373 7.3742 0)(8.3398 7.8619 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.1178 4.8821 0)(9.685 5.3985 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5129 6.0054 0)(11.8206 6.5459 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.9453 7.3134 0)(9.6553 7.8019 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.5703 4.8131 0)(16.2369 5.1271 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.269 4.114 0)(9.6364 4.4938 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6313 8.0666 0)(9.0214 8.4031 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.7289 8.3056 0)(13.436 8.7945 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.0051 3.6896 0)(14.6022 4.0738 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.8956 6.246 0)(13.5004 6.6381 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.5746 8.9493 0)(18.0791 9.3933 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.7675 8.2731 0)(4.163 8.8064 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.2734 8.8567 0)(3.6354 9.2619 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.8927 6.9205 0)(12.4754 7.5168 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.7154 7.3667 0)(11.2377 7.9013 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.2409 2.3576 0)(11.6325 2.9091 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.9138 4.3795 0)(15.6628 4.6821 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.7504 4.6703 0)(12.5315 5.1008 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3729 7.7006 0)(8.7435 8.0624 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.7258 2.4055 0)(18.1953 2.7501 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.5719 8.5641 0)(16.9285 9.029 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3609 1.2439 0)(9.0485 1.5506 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.6103 8.2118 0)(7.982 8.5749 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.103 7.4166 0)(17.5591 7.9683 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.4077 7.2328 0)(3.8569 7.7007 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.3917 3.4189 0)(15.9136 3.8004 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.2136 7.0251 0)(17.7543 7.3676 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.0561 1.6093 0)(8.7711 1.9351 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.1799 6.5268 0)(16.9235 6.8506 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.7341 8.8447 0)(8.3732 9.2004 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.7839 1.5949 0)(12.5099 1.9906 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.8701 5.42 0)(16.1998 5.7896 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.5881 2.8451 0)(18.0608 3.2821 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.2367 2.037 0)(7.6493 2.4124 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.4983 3.0899 0)(9.9311 3.6714 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.042 5.86 0)(12.7337 6.365 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.2169 3.165 0)(7.8071 3.6822 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.6739 9.0191 0)(3.9969 9.5859 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.4241 7.9515 0)(14.727 8.3743 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.4606 4.9223 0)(4.876 5.2497 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.2672 9.0953 0)(4.629 9.4072 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.2113 1.6675 0)(11.7605 2.2007 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.8256 1.2565 0)(11.1287 1.8214 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.5029 4.8076 0)(4.2785 5.3744 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.6453 1.1248 0)(4.3096 1.5033 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.5391 7.4673 0)(7.12 8.0202 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3635 5.7282 0)(8.7104 6.2631 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.8623 2.2431 0)(10.2555 2.7501 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.0271 9.2455 0)(10.5309 9.6326 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.3783 5.5916 0)(18.0993 5.9415 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.4728 3.745 0)(18.0984 4.2794 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.8181 2.3925 0)(8.4543 2.9177 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.8306 8.4163 0)(11.1985 8.7318 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.2423 7.1502 0)(14.7966 7.678 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.8848 1.1618 0)(13.3091 1.5784 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.3971 8.5024 0)(9.8945 8.895 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.2273 7.3665 0)(13.5685 7.7645 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.8077 6.1113 0)(11.1796 6.4871 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.8878 3.8499 0)(16.562 4.3586 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.2544 5.6752 0)(9.6144 6.0602 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.7309 6.0736 0)(8.1364 6.3811 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.2874 7.7513 0)(16.8903 8.056 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.4847 4.0264 0)(5.8126 4.3559 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.6617 5.6142 0)(10.0149 6.1019 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.7711 5.4248 0)(6.4771 5.8885 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.683 7.6933 0)(18.3291 8.0085 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.9943 9.0702 0)(13.5641 9.6399 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3839 4.8341 0)(8.8899 5.1999 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.7314 6.3574 0)(15.2104 6.683 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.6119 9.1112 0)(15.0972 9.6729 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.6445 8.9185 0)(9.9672 9.3382 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.426 4.7491 0)(13.76 5.14 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.2832 1.5999 0)(3.6853 2.0095 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.9279 2.7745 0)(16.3259 3.3609 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.7606 6.5021 0)(5.0651 6.8403 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.2643 9.1582 0)(15.7461 9.7195 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.3223 8.9311 0)(12.6765 9.3096 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.0275 5.3152 0)(14.5169 5.7735 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.8311 1.2382 0)(17.4504 1.8158 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.9437 8.6665 0)(17.5652 9.2052 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.0891 3.3022 0)(17.7463 3.6503 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.0673 6.5839 0)(10.6387 6.997 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.5501 9.3197 0)(8.8626 9.6284 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5821 3.9715 0)(7.8869 4.4534 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.4696 1.2237 0)(14.8373 1.5973 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.686 6.8696 0)(13.0259 7.3998 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.2089 5.9559 0)(5.5159 6.2893 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.19 3.7545 0)(10.5892 4.196 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.6947 1.2179 0)(18.1965 1.7368 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1041 4.9335 0)(15.5364 5.3967 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (3.7734 1.5874 0)(4.5394 2.0755 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.9369 4.171 0)(8.2373 4.7113 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.5833 3.7191 0)(10.0678 4.1007 0.4);
    }
    {
        name    fluid; type cellSet; action new;
        source  cellToCell; set buildingCells;
    }
    {
        name    fluid; type cellSet; action invert;
    }
);

// ************************************************************************* //
